Revit 2024 API
PanelScheduleData.ScheduleType Property
 The panel schedule type of this panel schedule
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public PanelScheduleType ScheduleType { get; }
Visual Basic
Public ReadOnly Property ScheduleType As PanelScheduleType
	Get
Visual C++
public:
property PanelScheduleType ScheduleType {
	PanelScheduleType get ();
}
See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace